# CutType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..CutType Property
FabricationPart Class See Also
---
The cut type of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int CutType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutType As Integer
	Get
```

Visual C++
---
```text
public:
property int CutType {
	int get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace